open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ble_gatt.c
/****************************************************************************
 * chips/bk7258/ap/
 * bk7258_ble_gatt.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Chip-owned N13 BLE peripheral service over the unmodified NuttX GATT
 * server.  ATT callbacks are bounded producers; all lifecycle commands and
 * notification work run in one logical-CPU0 kernel thread.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_BLE_GATT

#include <errno.h>
#include <sched.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <sys/param.h>
#include <sys/types.h>

#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>
#include <nuttx/wireless/bluetooth/bt_core.h>
#include <nuttx/wireless/bluetooth/bt_gatt.h>
#include <nuttx/wireless/bluetooth/bt_hci.h>
#include <nuttx/wireless/bluetooth/bt_uuid.h>

#include <arch/chip/bk7258_ble_gatt.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_BLE_GATT_WORKER_NAME          "bk7258-ble-gatt"
#define BK7258_BLE_GATT_EVENT_QUEUE_DEPTH    8u
#define BK7258_BLE_GATT_INIT_TIMEOUT_MS      5000u

/* The pinned v3.1.1.9 AP SDK maps BT_IPC_TASK_PRIO=4 to NuttX priority 98.
 * The transport callback must return its SDK-owned pointer before LPWORK can
 * process the copied HCI event and enqueue a command back to CP.
 */

#define BK7258_BLE_GATT_BT_IPC_PRIORITY      98

#define BK7258_BLE_H4_EVENT                  0x04u
#define BK7258_BLE_H4_EVENT_HEADER_SIZE      3u
#define BK7258_BLE_EVT_DISCONNECTED          0x05u
#define BK7258_BLE_EVT_LE_META               0x3eu
#define BK7258_BLE_SUBEVT_LE_CONNECTED       0x01u
#define BK7258_BLE_SUBEVT_LE_ENH_CONNECTED   0x0au

#define BK7258_BLE_FRAME_MAGIC_OFFSET        0u
#define BK7258_BLE_FRAME_VERSION_OFFSET      4u
#define BK7258_BLE_FRAME_OPCODE_OFFSET       5u
#define BK7258_BLE_FRAME_COUNT_OFFSET        6u
#define BK7258_BLE_FRAME_SEQUENCE_OFFSET     8u
#define BK7258_BLE_FRAME_VALUE_OFFSET        12u

static_assert(sizeof(CONFIG_DEVICE_LOCAL_NAME) <= 29u,
              "N13 local name exceeds a legacy scan-response element");
static_assert(sizeof(CONFIG_DEVICE_NAME) <= UINT8_MAX,
              "N13 GAP Device Name exceeds the current GATT read ABI");
static_assert(CONFIG_BLUETOOTH_MAX_CONN == 1,
              "N13 current CCC/notify contract is single-connection only");

#ifdef CONFIG_SCHED_LPWORKPRIORITY
static_assert(CONFIG_SCHED_LPWORKPRIORITY <
              BK7258_BLE_GATT_BT_IPC_PRIORITY,
              "N13 LPWORK must remain below the SDK Bluetooth IPC thread");
static_assert(CONFIG_BK7258_BLE_GATT_PRIORITY <
              CONFIG_SCHED_LPWORKPRIORITY,
              "N13 worker must remain below Bluetooth LPWORK");
#endif

static_assert(CONFIG_BLUETOOTH_TXCMD_PRIORITY >
              BK7258_BLE_GATT_BT_IPC_PRIORITY,
              "N13 HCI TX must remain above the SDK Bluetooth IPC thread");

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum bk7258_ble_gatt_event_type_e
{
  BK7258_BLE_GATT_EVENT_INITIALIZE = 1,
  BK7258_BLE_GATT_EVENT_CONNECTED,
  BK7258_BLE_GATT_EVENT_DISCONNECTED,
  BK7258_BLE_GATT_EVENT_REQUEST
};

struct bk7258_ble_gatt_event_s
{
  uint8_t type;
  uint8_t reason;
  uint16_t handle;
  struct bk7258_ble_gatt_frame_s frame;
};

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

/* The current NuttX checkout exposes its GATT database API publicly but
 * keeps advertising lifecycle declarations in bt_hcicore.h.  Declare only
 * the two pinned symbols used by this chip adapter; do not include or edit
 * the private upstream header.
 */

extern int bt_start_advertising(uint8_t type,
                                const struct bt_eir_s *ad,
                                const struct bt_eir_s *sd);
extern int bt_stop_advertising(void);

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_ble_gatt_read_name(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset);
static int bk7258_ble_gatt_read_appearance(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset);
static int bk7258_ble_gatt_read_control(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset);
static int bk7258_ble_gatt_write_control(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr,
  const void *buffer, uint8_t length, uint16_t offset);
static int bk7258_ble_gatt_read_status(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset);
static void bk7258_ble_gatt_ccc_changed(uint16_t value);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bt_uuid_s g_gap_uuid =
{
  .type = BT_UUID_16,
  .u.u16 = BT_UUID_GAP,
};

static struct bt_uuid_s g_name_uuid =
{
  .type = BT_UUID_16,
  .u.u16 = BT_UUID_GAP_DEVICE_NAME,
};

static struct bt_uuid_s g_appearance_uuid =
{
  .type = BT_UUID_16,
  .u.u16 = BT_UUID_GAP_APPEARANCE,
};

/* Bluetooth transmits UUID128 values least-significant octet first. */

static struct bt_uuid_s g_service_uuid =
{
  .type = BT_UUID_128,
  .u.u128 =
  {
    0x00, 0x45, 0x4c, 0x42, 0x5f, 0x54, 0x54, 0x41,
    0x47, 0x33, 0x31, 0x4e, 0x01, 0x00, 0x58, 0x72
  },
};

