open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ble_gatt.c
static struct bt_uuid_s g_control_uuid =
{
  .type = BT_UUID_128,
  .u.u128 =
  {
    0x00, 0x45, 0x4c, 0x42, 0x5f, 0x54, 0x54, 0x41,
    0x47, 0x33, 0x31, 0x4e, 0x02, 0x00, 0x58, 0x72
  },
};

static struct bt_uuid_s g_status_uuid =
{
  .type = BT_UUID_128,
  .u.u128 =
  {
    0x00, 0x45, 0x4c, 0x42, 0x5f, 0x54, 0x54, 0x41,
    0x47, 0x33, 0x31, 0x4e, 0x03, 0x00, 0x58, 0x72
  },
};

static struct bt_gatt_chrc_s g_name_chrc =
{
  .properties = BT_GATT_CHRC_READ,
  .value_handle = BK7258_BLE_GATT_NAME_VALUE_HANDLE,
  .uuid = &g_name_uuid,
};

static struct bt_gatt_chrc_s g_appearance_chrc =
{
  .properties = BT_GATT_CHRC_READ,
  .value_handle = BK7258_BLE_GATT_APPEARANCE_VALUE_HANDLE,
  .uuid = &g_appearance_uuid,
};

static struct bt_gatt_chrc_s g_control_chrc =
{
  .properties = BT_GATT_CHRC_READ | BT_GATT_CHRC_WRITE,
  .value_handle = BK7258_BLE_GATT_CONTROL_VALUE_HANDLE,
  .uuid = &g_control_uuid,
};

static struct bt_gatt_chrc_s g_status_chrc =
{
  .properties = BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY,
  .value_handle = BK7258_BLE_GATT_STATUS_VALUE_HANDLE,
  .uuid = &g_status_uuid,
};

static struct bt_gatt_ccc_cfg_s g_status_ccc[1];

static const struct bt_gatt_attr_s g_attributes[] =
{
  BT_GATT_PRIMARY_SERVICE(BK7258_BLE_GATT_GAP_SERVICE_HANDLE,
                          &g_gap_uuid),
  BT_GATT_CHARACTERISTIC(BK7258_BLE_GATT_NAME_CHRC_HANDLE,
                         &g_name_chrc),
  BT_GATT_DESCRIPTOR(BK7258_BLE_GATT_NAME_VALUE_HANDLE, &g_name_uuid,
                     BT_GATT_PERM_READ, bk7258_ble_gatt_read_name, NULL,
                     (void *)CONFIG_DEVICE_NAME),
  BT_GATT_CHARACTERISTIC(BK7258_BLE_GATT_APPEARANCE_CHRC_HANDLE,
                         &g_appearance_chrc),
  BT_GATT_DESCRIPTOR(BK7258_BLE_GATT_APPEARANCE_VALUE_HANDLE,
                     &g_appearance_uuid, BT_GATT_PERM_READ,
                     bk7258_ble_gatt_read_appearance, NULL, NULL),
  BT_GATT_PRIMARY_SERVICE(BK7258_BLE_GATT_SERVICE_HANDLE,
                          &g_service_uuid),
  BT_GATT_CHARACTERISTIC(BK7258_BLE_GATT_CONTROL_CHRC_HANDLE,
                         &g_control_chrc),
  BT_GATT_DESCRIPTOR(BK7258_BLE_GATT_CONTROL_VALUE_HANDLE,
                     &g_control_uuid,
                     BT_GATT_PERM_READ | BT_GATT_PERM_WRITE,
                     bk7258_ble_gatt_read_control,
                     bk7258_ble_gatt_write_control, NULL),
  BT_GATT_CHARACTERISTIC(BK7258_BLE_GATT_STATUS_CHRC_HANDLE,
                         &g_status_chrc),
  BT_GATT_DESCRIPTOR(BK7258_BLE_GATT_STATUS_VALUE_HANDLE,
                     &g_status_uuid, BT_GATT_PERM_READ,
                     bk7258_ble_gatt_read_status, NULL, NULL),
  BT_GATT_CCC(BK7258_BLE_GATT_STATUS_CCC_HANDLE,
              BK7258_BLE_GATT_STATUS_VALUE_HANDLE,
              g_status_ccc, bk7258_ble_gatt_ccc_changed),
};

static const struct bt_eir_s g_advertising_data[] =
{
  {
    .len = 2,
    .type = BT_EIR_FLAGS,
    .data = { BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR },
  },
  {
    .len = 17,
    .type = BT_EIR_UUID128_ALL,
    .data =
    {
      0x00, 0x45, 0x4c, 0x42, 0x5f, 0x54, 0x54, 0x41,
      0x47, 0x33, 0x31, 0x4e, 0x01, 0x00, 0x58, 0x72
    },
  },
  {
    .len = 0,
  },
};

static const struct bt_eir_s g_scan_response_data[] =
{
  {
    .len = sizeof(CONFIG_DEVICE_LOCAL_NAME),
    .type = BT_EIR_NAME_COMPLETE,
    .data = CONFIG_DEVICE_LOCAL_NAME,
  },
  {
    .len = 0,
  },
};

static sem_t g_event_sem;
static sem_t g_init_sem;
static spinlock_t g_lock = SP_UNLOCKED;
static struct bk7258_ble_gatt_event_s
  g_events[BK7258_BLE_GATT_EVENT_QUEUE_DEPTH];
static struct bk7258_ble_gatt_frame_s g_control_frame;
static struct bk7258_ble_gatt_frame_s g_status_frame;
static uint8_t g_event_head;
static uint8_t g_event_tail;
static uint8_t g_event_count;
static int g_init_result;
static pid_t g_worker = INVALID_PROCESS_ID;
static bool g_queue_ready;
static bool g_initialized;
static bool g_attributes_registered;
static struct bk7258_ble_gatt_stats_s g_stats =
{
  .state = BK7258_BLE_GATT_STATE_DISABLED,
  .worker_cpu = UINT32_MAX,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static uint16_t bk7258_ble_gatt_get_le16(const uint8_t *data)
{
  return (uint16_t)data[0] | (uint16_t)data[1] << 8;
}

static uint32_t bk7258_ble_gatt_get_le32(const uint8_t *data)
{
  return (uint32_t)data[0] |
         (uint32_t)data[1] << 8 |
         (uint32_t)data[2] << 16 |
         (uint32_t)data[3] << 24;
}

static void bk7258_ble_gatt_put_le16(uint8_t *data, uint16_t value)
{
  data[0] = (uint8_t)value;
  data[1] = (uint8_t)(value >> 8);
}

static void bk7258_ble_gatt_put_le32(uint8_t *data, uint32_t value)
{
  data[0] = (uint8_t)value;
  data[1] = (uint8_t)(value >> 8);
  data[2] = (uint8_t)(value >> 16);
  data[3] = (uint8_t)(value >> 24);
}

static uint32_t bk7258_ble_gatt_crc32(const uint8_t *data, size_t length)
{
  uint32_t crc = UINT32_MAX;
  unsigned int bit;
  size_t i;

  for (i = 0; i < length; i++)
    {
      crc ^= data[i];
      for (bit = 0; bit < 8; bit++)
        {
          crc = (crc >> 1) ^
                (0xedb88320u & (uint32_t)-(int32_t)(crc & 1u));
        }
    }

  return crc ^ UINT32_MAX;
}

static void bk7258_ble_gatt_frame_finalize(
  struct bk7258_ble_gatt_frame_s *frame)
{
  bk7258_ble_gatt_put_le32(
    &frame->data[BK7258_BLE_GATT_FRAME_CRC_OFFSET],
    bk7258_ble_gatt_crc32(frame->data,
                         BK7258_BLE_GATT_FRAME_CRC_OFFSET));
}

static void bk7258_ble_gatt_frame_initialize(
  struct bk7258_ble_gatt_frame_s *frame, uint8_t opcode, uint16_t count,
  uint32_t sequence, uint32_t value)
{
  memset(frame, 0, sizeof(*frame));
  bk7258_ble_gatt_put_le32(&frame->data[BK7258_BLE_FRAME_MAGIC_OFFSET],
                          BK7258_BLE_GATT_FRAME_MAGIC);
  frame->data[BK7258_BLE_FRAME_VERSION_OFFSET] =
    BK7258_BLE_GATT_FRAME_VERSION;
  frame->data[BK7258_BLE_FRAME_OPCODE_OFFSET] = opcode;
  bk7258_ble_gatt_put_le16(&frame->data[BK7258_BLE_FRAME_COUNT_OFFSET],
                           count);
  bk7258_ble_gatt_put_le32(&frame->data[BK7258_BLE_FRAME_SEQUENCE_OFFSET],
                           sequence);
  bk7258_ble_gatt_put_le32(&frame->data[BK7258_BLE_FRAME_VALUE_OFFSET],
                           value);
  bk7258_ble_gatt_frame_finalize(frame);
}

