open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ble_gatt.c
static void bk7258_ble_gatt_set_state(enum bk7258_ble_gatt_state_e state,
                                      int error)
{
  __atomic_store_n(&g_stats.last_error, error, __ATOMIC_RELAXED);
  __atomic_store_n(&g_stats.state, (uint32_t)state, __ATOMIC_RELEASE);
}

static bool bk7258_ble_gatt_queue(
  const struct bk7258_ble_gatt_event_s *event)
{
  irqstate_t flags;
  bool queued = false;

  if (!__atomic_load_n(&g_queue_ready, __ATOMIC_ACQUIRE))
    {
      return false;
    }

  flags = spin_lock_irqsave(&g_lock);
  if (g_event_count < BK7258_BLE_GATT_EVENT_QUEUE_DEPTH)
    {
      g_events[g_event_tail] = *event;
      g_event_tail = (uint8_t)((g_event_tail + 1u) %
                               BK7258_BLE_GATT_EVENT_QUEUE_DEPTH);
      g_event_count++;
      queued = true;
    }
  spin_unlock_irqrestore(&g_lock, flags);

  if (queued)
    {
      nxsem_post(&g_event_sem);
    }
  else
    {
      __atomic_fetch_add(&g_stats.queue_full, 1u, __ATOMIC_RELAXED);
    }

  return queued;
}

static bool bk7258_ble_gatt_dequeue(struct bk7258_ble_gatt_event_s *event)
{
  irqstate_t flags;
  bool dequeued = false;

  flags = spin_lock_irqsave(&g_lock);
  if (g_event_count > 0)
    {
      *event = g_events[g_event_head];
      g_event_head = (uint8_t)((g_event_head + 1u) %
                               BK7258_BLE_GATT_EVENT_QUEUE_DEPTH);
      g_event_count--;
      dequeued = true;
    }
  spin_unlock_irqrestore(&g_lock, flags);
  return dequeued;
}

static void bk7258_ble_gatt_store_frame(
  struct bk7258_ble_gatt_frame_s *destination,
  const struct bk7258_ble_gatt_frame_s *source)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&g_lock);
  *destination = *source;
  spin_unlock_irqrestore(&g_lock, flags);
}

static void bk7258_ble_gatt_load_frame(
  struct bk7258_ble_gatt_frame_s *destination,
  const struct bk7258_ble_gatt_frame_s *source)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&g_lock);
  *destination = *source;
  spin_unlock_irqrestore(&g_lock, flags);
}

static int bk7258_ble_gatt_read_name(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset)
{
  const char *name = attr->user_data;

  return bt_gatt_attr_read(conn, attr, buffer, length, offset, name,
                           (uint8_t)strlen(name));
}

static int bk7258_ble_gatt_read_appearance(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset)
{
  uint16_t appearance = BT_HOST2LE16(CONFIG_DEVICE_APPEARANCE);

  return bt_gatt_attr_read(conn, attr, buffer, length, offset, &appearance,
                           sizeof(appearance));
}

static int bk7258_ble_gatt_read_frame(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset,
  const struct bk7258_ble_gatt_frame_s *source)
{
  struct bk7258_ble_gatt_frame_s snapshot;

  bk7258_ble_gatt_load_frame(&snapshot, source);
  return bt_gatt_attr_read(conn, attr, buffer, length, offset,
                           snapshot.data, sizeof(snapshot.data));
}

static int bk7258_ble_gatt_read_control(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset)
{
  return bk7258_ble_gatt_read_frame(conn, attr, buffer, length, offset,
                                    &g_control_frame);
}

static int bk7258_ble_gatt_read_status(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr, void *buffer,
  uint8_t length, uint16_t offset)
{
  return bk7258_ble_gatt_read_frame(conn, attr, buffer, length, offset,
                                    &g_status_frame);
}

static int bk7258_ble_gatt_write_control(
  struct bt_conn_s *conn, const struct bt_gatt_attr_s *attr,
  const void *buffer, uint8_t length, uint16_t offset)
{
  const uint8_t *data = buffer;
  struct bk7258_ble_gatt_event_s event;
  uint16_t count;
  uint32_t expected_crc;
  uint32_t actual_crc;
  uint8_t opcode;

  (void)conn;
  (void)attr;

  if (offset != 0)
    {
      __atomic_fetch_add(&g_stats.writes_bad_offset, 1u,
                         __ATOMIC_RELAXED);
      return -EINVAL;
    }

  if (length != BK7258_BLE_GATT_FRAME_SIZE)
    {
      __atomic_fetch_add(&g_stats.writes_bad_length, 1u,
                         __ATOMIC_RELAXED);
      return -EFBIG;
    }

  if (bk7258_ble_gatt_get_le32(&data[BK7258_BLE_FRAME_MAGIC_OFFSET]) !=
      BK7258_BLE_GATT_FRAME_MAGIC)
    {
      __atomic_fetch_add(&g_stats.writes_bad_magic, 1u, __ATOMIC_RELAXED);
      return -EBADMSG;
    }

  if (data[BK7258_BLE_FRAME_VERSION_OFFSET] !=
      BK7258_BLE_GATT_FRAME_VERSION)
    {
      __atomic_fetch_add(&g_stats.writes_bad_version, 1u,
                         __ATOMIC_RELAXED);
      return -EBADMSG;
    }

  opcode = data[BK7258_BLE_FRAME_OPCODE_OFFSET];
  if (opcode != BK7258_BLE_GATT_OPCODE_ECHO &&
      opcode != BK7258_BLE_GATT_OPCODE_BURST)
    {
      __atomic_fetch_add(&g_stats.writes_bad_opcode, 1u,
                         __ATOMIC_RELAXED);
      return -EOPNOTSUPP;
    }

  count = bk7258_ble_gatt_get_le16(
    &data[BK7258_BLE_FRAME_COUNT_OFFSET]);
  if ((opcode == BK7258_BLE_GATT_OPCODE_ECHO && count != 1u) ||
      (opcode == BK7258_BLE_GATT_OPCODE_BURST &&
       (count == 0u || count > BK7258_BLE_GATT_MAX_BURST)))
    {
      __atomic_fetch_add(&g_stats.writes_bad_count, 1u,
                         __ATOMIC_RELAXED);
      return -ERANGE;
    }

  expected_crc = bk7258_ble_gatt_get_le32(
    &data[BK7258_BLE_GATT_FRAME_CRC_OFFSET]);
  actual_crc = bk7258_ble_gatt_crc32(
    data, BK7258_BLE_GATT_FRAME_CRC_OFFSET);
  if (expected_crc != actual_crc)
    {
      __atomic_fetch_add(&g_stats.writes_bad_crc, 1u, __ATOMIC_RELAXED);
      return -EBADMSG;
    }

  memset(&event, 0, sizeof(event));
  event.type = BK7258_BLE_GATT_EVENT_REQUEST;
  memcpy(event.frame.data, data, sizeof(event.frame.data));
  if (!bk7258_ble_gatt_queue(&event))
    {
      return -EAGAIN;
    }

  bk7258_ble_gatt_store_frame(&g_control_frame, &event.frame);
  __atomic_fetch_add(&g_stats.writes_accepted, 1u, __ATOMIC_RELAXED);
  return length;
}

static void bk7258_ble_gatt_ccc_changed(uint16_t value)
{
  __atomic_store_n(&g_stats.subscribed,
                   value == BT_GATT_CCC_NOTIFY ? 1u : 0u,
                   __ATOMIC_RELEASE);
  __atomic_fetch_add(&g_stats.ccc_changes, 1u, __ATOMIC_RELAXED);
}

static int bk7258_ble_gatt_start(void)
{
  return bt_start_advertising(BT_LE_ADV_IND, g_advertising_data,
                              g_scan_response_data);
}

static void bk7258_ble_gatt_cleanup_worker(void)
{
  __atomic_store_n(&g_queue_ready, false, __ATOMIC_RELEASE);

