open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ble_gatt.c
  if (g_worker != INVALID_PROCESS_ID)
    {
      (void)kthread_delete(g_worker);
      g_worker = INVALID_PROCESS_ID;
    }

  nxsem_destroy(&g_init_sem);
  nxsem_destroy(&g_event_sem);
  g_event_head = 0;
  g_event_tail = 0;
  g_event_count = 0;
}

static void bk7258_ble_gatt_process_initialize(void)
{
  int ret;

  bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_INITIALIZING, 0);

  ret = bt_stop_advertising();
  if (ret != OK && ret != -EALREADY)
    {
      goto failed;
    }

  /* NuttX exposes no GATT attribute unregister operation.  Treat the
   * static table as a Host-lifetime root and never register it twice when
   * advertising initialization is retried after a transient failure.
   */

  if (!g_attributes_registered)
    {
      bt_gatt_register(g_attributes, nitems(g_attributes));
      g_attributes_registered = true;
    }
  ret = bk7258_ble_gatt_start();
  if (ret != OK)
    {
      goto failed;
    }

  bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_ADVERTISING, 0);
  g_init_result = OK;
  nxsem_post(&g_init_sem);
  return;

failed:
  bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_FAULTED, ret);
  g_init_result = ret;
  nxsem_post(&g_init_sem);
}

static void bk7258_ble_gatt_process_connected(
  const struct bk7258_ble_gatt_event_s *event)
{
  int ret;

  /* Legacy advertising stops automatically when the Controller accepts a
   * connection, but the current NuttX Host leaves g_btdev.adv_enable set.
   * Synchronize that Host-side state here, after stock LPWORK has processed
   * Connection Complete.  Otherwise hci_disconn_complete() races us by
   * sending an automatic enable before the board worker can perform the
   * official-sample-style restart.
   */

  ret = bt_stop_advertising();
  if (ret != OK && ret != -EALREADY && ret != -EIO)
    {
      bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_FAULTED, ret);
      return;
    }

  /* A successful LE Connection Complete proves that legacy advertising has
   * already stopped in the Controller.  The stock API clears its stale
   * g_btdev.adv_enable flag before sending a redundant disable command, but
   * maps every non-zero HCI status for that command to -EIO.  Accept -EIO only
   * at this post-connection synchronization point; allocation, queue and
   * timeout failures remain fatal.
   */

  __atomic_store_n(&g_stats.active_handle, event->handle,
                   __ATOMIC_RELAXED);
  __atomic_fetch_add(&g_stats.connected, 1u, __ATOMIC_RELAXED);
  bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_CONNECTED, 0);
}

static void bk7258_ble_gatt_process_disconnected(
  const struct bk7258_ble_gatt_event_s *event)
{
  int ret;

  (void)event;
  __atomic_store_n(&g_stats.active_handle, 0u, __ATOMIC_RELAXED);
  __atomic_store_n(&g_stats.subscribed, 0u, __ATOMIC_RELEASE);
  __atomic_fetch_add(&g_stats.disconnected, 1u, __ATOMIC_RELAXED);

  /* The connection worker cleared NuttX's stale advertising-enabled state,
   * so stock hci_disconn_complete() only performs ATT/connection cleanup and
   * does not send an automatic enable.  Match the official SDK sample by
   * starting advertising exactly once from this deferred worker.
   *
   * The priority chain HCI TX > SDK Bluetooth IPC > LPWORK > this worker
   * ensures the SDK-owned receive pointer is returned before any restart
   * command enters the mailbox wrapper.  Controller-to-Host flow control is
   * disabled and its redundant 0x0c35 acknowledgements are filtered by the
   * board HCI lower half, so this synchronous sequence retains command credit.
   */

  ret = bk7258_ble_gatt_start();
  if (ret != OK)
    {
      bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_FAULTED, ret);
      return;
    }

  __atomic_fetch_add(&g_stats.readvertised, 1u, __ATOMIC_RELAXED);
  bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_ADVERTISING, 0);
}

static void bk7258_ble_gatt_publish_response(
  struct bk7258_ble_gatt_frame_s *response)
{
  bk7258_ble_gatt_frame_finalize(response);
  bk7258_ble_gatt_store_frame(&g_status_frame, response);

  if (__atomic_load_n(&g_stats.subscribed, __ATOMIC_ACQUIRE) != 0u)
    {
      bt_gatt_notify(BK7258_BLE_GATT_STATUS_VALUE_HANDLE,
                     response->data, sizeof(response->data));
      __atomic_fetch_add(&g_stats.notify_attempted, 1u,
                         __ATOMIC_RELAXED);
    }
}

static void bk7258_ble_gatt_process_request(
  const struct bk7258_ble_gatt_event_s *event)
{
  struct bk7258_ble_gatt_frame_s response = event->frame;
  uint32_t sequence;
  uint32_t value;
  uint16_t count;
  uint16_t i;
  uint8_t opcode;

  opcode = event->frame.data[BK7258_BLE_FRAME_OPCODE_OFFSET];
  count = bk7258_ble_gatt_get_le16(
    &event->frame.data[BK7258_BLE_FRAME_COUNT_OFFSET]);
  sequence = bk7258_ble_gatt_get_le32(
    &event->frame.data[BK7258_BLE_FRAME_SEQUENCE_OFFSET]);
  value = bk7258_ble_gatt_get_le32(
    &event->frame.data[BK7258_BLE_FRAME_VALUE_OFFSET]);
  response.data[BK7258_BLE_FRAME_OPCODE_OFFSET] =
    opcode | BK7258_BLE_GATT_RESPONSE_BIT;

  if (opcode == BK7258_BLE_GATT_OPCODE_ECHO)
    {
      bk7258_ble_gatt_publish_response(&response);
      return;
    }

  for (i = 0; i < count; i++)
    {
      if (__atomic_load_n(&g_stats.subscribed, __ATOMIC_ACQUIRE) == 0u)
        {
          break;
        }

      bk7258_ble_gatt_put_le32(
        &response.data[BK7258_BLE_FRAME_SEQUENCE_OFFSET], sequence + i);
      bk7258_ble_gatt_put_le32(
        &response.data[BK7258_BLE_FRAME_VALUE_OFFSET], value + i);
      bk7258_ble_gatt_publish_response(&response);
      if (i + 1u < count)
        {
          (void)nxsig_usleep(
            CONFIG_BK7258_BLE_GATT_NOTIFY_INTERVAL_MS * 1000u);
        }
    }
}

static int bk7258_ble_gatt_worker(int argc, char *argv[])
{
  struct bk7258_ble_gatt_event_s event;
  int cpu;

  (void)argc;
  (void)argv;
  cpu = sched_getcpu();
  __atomic_store_n(&g_stats.worker_cpu,
                   cpu >= 0 ? (uint32_t)cpu : UINT32_MAX,
                   __ATOMIC_RELAXED);

  for (; ; )
    {
      if (nxsem_wait_uninterruptible(&g_event_sem) < 0)
        {
          continue;
        }

      while (bk7258_ble_gatt_dequeue(&event))
        {
          switch (event.type)
            {
              case BK7258_BLE_GATT_EVENT_INITIALIZE:
                bk7258_ble_gatt_process_initialize();
                break;

              case BK7258_BLE_GATT_EVENT_CONNECTED:
                bk7258_ble_gatt_process_connected(&event);
                break;

