open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ble_gatt.c
              case BK7258_BLE_GATT_EVENT_DISCONNECTED:
                bk7258_ble_gatt_process_disconnected(&event);
                break;

              case BK7258_BLE_GATT_EVENT_REQUEST:
                bk7258_ble_gatt_process_request(&event);
                break;

              default:
                break;
            }
        }
    }

  return EXIT_SUCCESS;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_ble_gatt_initialize(void)
{
  struct bk7258_ble_gatt_event_s event;
  cpu_set_t cpuset;
  int ret;

  if (g_initialized)
    {
      return -EALREADY;
    }

  memset(g_status_ccc, 0, sizeof(g_status_ccc));
  memset(&g_control_frame, 0, sizeof(g_control_frame));
  bk7258_ble_gatt_frame_initialize(
    &g_status_frame,
    BK7258_BLE_GATT_OPCODE_ECHO | BK7258_BLE_GATT_RESPONSE_BIT,
    0, 0, BK7258_BLE_GATT_STATE_INITIALIZING);
  g_event_head = 0;
  g_event_tail = 0;
  g_event_count = 0;
  g_init_result = -EINPROGRESS;

  ret = nxsem_init(&g_event_sem, 0, 0);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxsem_init(&g_init_sem, 0, 0);
  if (ret < 0)
    {
      nxsem_destroy(&g_event_sem);
      return ret;
    }

  __atomic_store_n(&g_queue_ready, true, __ATOMIC_RELEASE);
  g_worker = kthread_create(BK7258_BLE_GATT_WORKER_NAME,
                            CONFIG_BK7258_BLE_GATT_PRIORITY,
                            CONFIG_BK7258_BLE_GATT_STACKSIZE,
                            bk7258_ble_gatt_worker, NULL);
  if (g_worker < 0)
    {
      ret = (int)g_worker;
      __atomic_store_n(&g_queue_ready, false, __ATOMIC_RELEASE);
      nxsem_destroy(&g_init_sem);
      nxsem_destroy(&g_event_sem);
      return ret;
    }

#ifdef CONFIG_SMP
  CPU_ZERO(&cpuset);
  CPU_SET(0, &cpuset);
  ret = sched_setaffinity(g_worker, sizeof(cpuset), &cpuset);
  if (ret < 0)
    {
      bk7258_ble_gatt_cleanup_worker();
      return ret;
    }
#else
  (void)cpuset;
#endif

  memset(&event, 0, sizeof(event));
  event.type = BK7258_BLE_GATT_EVENT_INITIALIZE;
  if (!bk7258_ble_gatt_queue(&event))
    {
      bk7258_ble_gatt_cleanup_worker();
      return -EAGAIN;
    }

  ret = nxsem_tickwait_uninterruptible(
    &g_init_sem, MSEC2TICK(BK7258_BLE_GATT_INIT_TIMEOUT_MS));
  if (ret < 0)
    {
      bk7258_ble_gatt_set_state(BK7258_BLE_GATT_STATE_FAULTED, ret);
      bk7258_ble_gatt_cleanup_worker();
      return ret;
    }

  if (g_init_result != OK)
    {
      ret = g_init_result;
      bk7258_ble_gatt_cleanup_worker();
      return ret;
    }

  g_initialized = true;
  return OK;
}

void bk7258_ble_gatt_hci_event(const uint8_t *buffer, uint16_t length)
{
  struct bk7258_ble_gatt_event_s event;
  uint8_t payload_length;

  if (!__atomic_load_n(&g_queue_ready, __ATOMIC_ACQUIRE) ||
      buffer == NULL || length < BK7258_BLE_H4_EVENT_HEADER_SIZE ||
      buffer[0] != BK7258_BLE_H4_EVENT)
    {
      return;
    }

  payload_length = buffer[2];
  if ((size_t)length != BK7258_BLE_H4_EVENT_HEADER_SIZE + payload_length)
    {
      return;
    }

  memset(&event, 0, sizeof(event));
  if (buffer[1] == BK7258_BLE_EVT_LE_META && payload_length >= 4u &&
      (buffer[3] == BK7258_BLE_SUBEVT_LE_CONNECTED ||
       buffer[3] == BK7258_BLE_SUBEVT_LE_ENH_CONNECTED) &&
      buffer[4] == 0u)
    {
      event.type = BK7258_BLE_GATT_EVENT_CONNECTED;
      event.handle = bk7258_ble_gatt_get_le16(&buffer[5]);
      (void)bk7258_ble_gatt_queue(&event);
    }
  else if (buffer[1] == BK7258_BLE_EVT_DISCONNECTED &&
           payload_length >= 4u && buffer[3] == 0u)
    {
      event.type = BK7258_BLE_GATT_EVENT_DISCONNECTED;
      event.handle = bk7258_ble_gatt_get_le16(&buffer[4]);
      event.reason = buffer[6];
      (void)bk7258_ble_gatt_queue(&event);
    }
}

int bk7258_ble_gatt_get_stats(struct bk7258_ble_gatt_stats_s *stats)
{
  if (stats == NULL)
    {
      return -EINVAL;
    }

#define BK7258_BLE_LOAD_STAT(field, order) \
  stats->field = __atomic_load_n(&g_stats.field, order)
  BK7258_BLE_LOAD_STAT(state, __ATOMIC_ACQUIRE);
  BK7258_BLE_LOAD_STAT(last_error, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(worker_cpu, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(connected, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(disconnected, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(readvertised, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(queue_full, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_accepted, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_offset, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_length, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_magic, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_version, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_opcode, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_count, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(writes_bad_crc, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(ccc_changes, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(notify_attempted, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(active_handle, __ATOMIC_RELAXED);
  BK7258_BLE_LOAD_STAT(subscribed, __ATOMIC_ACQUIRE);
#undef BK7258_BLE_LOAD_STAT
  return OK;
}

#endif /* CONFIG_BK7258_BLE_GATT */
